var ri2 = new Array();

ri2['구룡포읍'] = '구룡포리,구평리,눌태리,병포리,삼정리,석병리,성동리,장길리,하정리,후동리';
ri2['대송면'] = '공수리,남성리,대각리,산여리,송리,옥명리,장리,제내리,홍계리';
ri2['동해면'] = '공당리,금광리,도구리,마산리,발산리,상정리,석리,신정리,약전리,임곡리,입암리,증산리,증흥리,흥환리';
ri2['연일읍'] = '괴정리,달전리,동문리,생지리,오천리,우복리,유강리,인주리,자명리,중단리,중명리,택전리,학전리';
ri2['오천읍'] = '갈평리,구정리,광명리,문덕리,문충리,세계리,용산리,용덕리,원리,진전리,항사리';
ri2['장기면'] = '계원리,금곡리,금오리,대곡리,대진리,두원리,마현리,모포리,방산리,산서리,서촌리,수성리,신계리,신창리,양포리,영암리,읍내리,임증리,정천리,죽정리,창지리,학계리,학곡리';
ri2['호미곶면'] = '강사리,구만리,대동배리,대보리';
ri2['기계면'] = '가안리,계전리,고지리,구지리,남계리,내단리,문성리,미현리,봉계리,성계리,인비리,지가리,학야리,현내리,화대리,화봉리';
ri2['기북면'] = '관천리,대곡리,성법리,오덕리,용기리,율산리,탑정리';
ri2['송라면'] = '광천리,대전리,방석리,상송리,조사리,중산리,지경리,하송리,화진리';
ri2['신광면'] = '기일리,냉수리,마북리,만석리,반곡리,사정리,상읍리,안덕리,우각리,죽성리,토성리,호리,흥곡리';
ri2['죽장면'] = '가사리,감곡리,두마리,매현리,방흥리,봉계리,상사리,상옥리,석계리,월평리,일광리,입암리,정자리,지동리,침곡리,하사리,하옥리,합덕리,현내리';
ri2['청하면'] = '고현리,덕성리,덕천리,명안리,미남리,방어리,상대리,서정리,소동리,신흥리,용두리,월포리,유계리,이가리,청계리,청진리,필화리,하대리';
ri2['흥해읍'] = '곡강리,금장리,남성리,남송리,대련리,덕성리,덕장리,마산리,매산리,망천리,북송리,성내리,성곡리,약성리,오도리,옥성리,양백리,용곡리,용전리,용천리,용한리,우목리,이인리,중성리,죽천리,칠포리,초곡리,학성리,학천리,흥안리';