<?
// 테이블을 정의
$taja_table               = $g4['table_prefix'] . "taja";         // 타자게임

// 하루에 할 수 있는 최대 게임 횟수
$today_max = 100;


// 한판당 주는 포인트
$p1 = 10;
$p2 = 20;
// 이동할 메뉴가 있다면?
$qstr = "currentId=89";

// 최대타수
$max_speed = 800;

// 타자문구
$typo = array(
                //라이센스입니다. 삭제하시면안됩니다.
				"버스팡은 대리점에서 공구 수수료를 받지 않는다",
				"최신폰은 버스팡에서 사는게 맞다",
				"네이버에 버스팡 검색! 호갱탈출 버스팡 커뮤니티",
				//라이센스 끝
				"순정넷은 순천의 정보통이다.",
				"간장공장공장장은 간공장장이고, 공장공장공장장은 공공장장이다.",
				"내가그린 기린그림은 긴 기린그림이고 니가그린기린그림은 안긴 기린 그림이다.",
				"배우고 때때로 익히니 이 또한 기쁘지 아니한가",
				"대한독립만세",
				"해보기나 했어?",
				"내가 그린 구름그림은 새털구름 그린 그림이고 네가 그린 구름그림은 양털구름 그린 그림이다.",
				"저 분은 백 법학박사이고 이 분은 박 법학박사이다.",
				"신진 샹숑가수의 신춘 샹숑쇼우",
				"작년에 온 솥장수는 새솥장수이고, 금년에 온 솥장수는 헌 솥장수이다.",
				"서울특별시 특허허가과 허가과장 허과장.",
				"저기 가는 저 상장사가 새 상 상장사냐 헌 상 상장사냐.",
				"옆집 팥죽은 붉은 팥죽이고, 뒷집 콩죽은 검은 콩죽이다.",
				"대우 로얄 뉴로얄.",
				"칠월칠일은 평창친구 친정 칠순 잔칫날.",
				"가난도 비단 가난",
				"한국관광공사 곽진광 관광과장",
				"가래장부는 본고을 좌수도 몰라본다",
				"가랑잎이 솔잎더러 바스락거린다고 한다",
				"고기 새끼 하나 보고 가마솥 부신다",
				"그 아버지에 그 아들",
				"급하면 바늘허리에 실 매어 쓸까",
				"나 많은 말이 콩 마다할까",
				"나는 새에게 여기 앉아라 저기 앉아라 할 수 없다",
				"누구네 제사날 기다리다가 사흘 굶은 거지 굶어 죽었다",
				"눈을 떠도 코 베어 간다",
				"눈이 아무리 밝아도 제 코는 안 보인다",
				"달기는 엿집 할머니 손가락이라",
				"달아나는 노루 보고 얻은 토끼를 놓았다",
				"두 손뼉이 맞아야 소리가 난다",
				"뒷집 짓고 앞집 뜯어 내란다",
				"아가리 마구 난 창구멍인가",
				"아는 걸 보니 소강절의 똥구멍에 움막 짓고 살았겠다",
				"아직 이도 나기 전에 갈비를 뜯는다",
				"자기 늙은 것은 몰라도 남 자라는 것은 안다",
				"자식을 낳기보다 부모 되기가 더 어렵다",
				"자식을 보기엔 아비만 한 눈이 없고 제자를 보기엔 스승만 한 눈이 없다",
				"잔치는 잘 먹은 놈 잘 차렸다 하고 못 먹은 놈 못 차렸다 한다",
				"잘 싸우는 장수에게는 내버릴 병사가 없고 글 잘 쓰는 사람에게는 내버릴 글자가 없다",
				"칼치가 제 꼬리 베 먹는다",
				"추어주면 엉뎅이 나가는 줄 모른다",
				"자식 과년하면 부모가 반중매쟁이 된다",
				"잔치 보러 왔다가 초상 본다", 
				"어느 틈엔가 유유히 흘러 정신을 차리고 보면 이 세상에서 가장 멋진 곳에 있기를.",
				"투자는 기다림이다.",
				"잔치 보러 왔다가 초상 본다"
        );
?>
